Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # cloudflare_record.casdoor[0] will be created
+ resource "cloudflare_record" "casdoor" {
      + allow_overwrite = false
      + content         = "103.214.23.41"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "sso"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 300
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "6e69310ba4000e47c0a2480e2606713a"
    }

  # helm_release.casdoor[0] will be created
+ resource "helm_release" "casdoor" {
      + atomic                     = false
      + chart                      = "casdoor-helm-charts"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "casdoor"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://registry-1.docker.io/casbin"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + (sensitive value),
        ]
      + verify                     = false
      + version                    = "v1.702.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # null_resource.casdoor_database[0] will be created
+ resource "null_resource" "casdoor_database" {
      + id       = (known after apply)
      + triggers = {
          + "always_run" = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ casdoor_url                    = "https://sso.zitian.party"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`